<template>
  <div>
    <table width="100%" height="100%" border="1">
      <tr>
        <td width="250px" rowspan="5" valign="top">
          <shu :数据_数据="树_数据"></shu>
        </td>
        <td align="center">
          <h1>{{标题}}</h1>
        </td>
      </tr>
      <tr>
        <td valign="top">
          <biaodanzu :数据_数据.sync="表单组_数据"></biaodanzu>
        </td>
      </tr>
      <tr>
        <td align="right">
          <anniuzu :数据_数据="按钮_数据" @按钮1="按钮事件($event)" @按钮2="按钮事件($event)"></anniuzu>
        </td>
      </tr>
      <tr>
        <td valign="top" align="center">
          <biaoge
            :数据_表头="表格_表头"
            :数据_要显示的列="表格_要显示的列"
            :数据_数据="表格_数据"
            :数据_样式预处理函数="表格_样式预处理函数"
            :数据_数据预处理函数="表格_数据预处理函数"
            :数据_点击事件="表格_点击事件"
          ></biaoge>
        </td>
      </tr>
      <tr>
        <td align="center">
          <fenye :数据_总页数="分页_总页数" :数据_当前页="分页_当前页"></fenye>
        </td>
      </tr>
    </table>
  </div>
</template>

<script>
import 构造vue组件 from "@lib/前端/构造vue组件";

export default 构造vue组件({
  数据: {
    标题: "你好世界",

    树_数据: [
      { 名称: "节点1", 父级: "" },
      { 名称: "节点2", 父级: "节点1" },
      { 名称: "节点3", 父级: "节点1" },
      { 名称: "节点4", 父级: "节点3" },
      { 名称: "节点5", 父级: "" },
    ],

    按钮_数据: [{ 名称: "按钮1" }, { 名称: "按钮2" }],

    表单组_数据: [
      { 名称: "输入框", 类型: "输入框", 提示字: "请输入一些文本", 值: "" },
      { 名称: "下拉框", 类型: "下拉框", 值: "" },
      { 名称: "日期选择", 类型: "日期选择", 值: "" },
      { 名称: "多选下拉框", 类型: "多选下拉框", 值: [] },
    ],

    表格_表头: [{ 名称: "a" }, { 名称: "b" }, { 名称: "c" }],
    表格_数据: [
      { a: 1, b: 2, c: 3 },
      { a: 1, b: 2, c: 3 },
      { a: 1, b: 2, c: 3 },
    ],
    表格_要显示的列: [{ 名称: "a" }, { 名称: "b" }, { 名称: "c" }],
    表格_样式预处理函数: function ({ 行号, 列名, 数据, 行数据 }) {
      return [];
    },
    表格_数据预处理函数: function ({ 行号, 列名, 数据, 行数据 }) {
      return 数据;
    },
    表格_点击事件({ 行号, 列名, 数据 }) {
      console.log({ 行号, 列名, 数据 });
    },

    分页_总页数: 10,
    分页_当前页: 1,
  },
  构造函数() {},
  函数: {
    按钮事件(a) {
      console.log(a);
    },
  },
});
</script>
